In [4]:
from google.colab import drive 
drive.mount('/drive')

Mounted at /drive

In [ ]:
#python Pandas
1. Dataframe 
2. SQL kind of stuff
3. Flexibility of Handling
#Pandas is package which is the most important tool for a data scientist. "Panel Data"
#Data over time - Exonometrics
#Helps calculate the Statistics of the data easily 
#In background it runs numpy 
#For VIsualizations makes use of Matplotlib

In [ ]:
#Pandas first steps 
!conda install pandas
!pip install pandas

In [11]:
import pandas
import pandas as pd

In [12]:
#DataFrame second core component of Pandas Series
data = {
    'Kholi': [34,35,40,60],
    'Dhoni':[50,60,24,14]
}

In [13]:
cricket_scores = pd.DataFrame(data)
cricket_scores

   Kholi  Dhoni
0     34     50
1     35     60
2     40     24
3     60     14

In [17]:
cricket_scores['Dhoni']

0    50
1    60
2    24
3    14
Name: Dhoni, dtype: int64

In [ ]:
1. DF - colums: orange, apples Values: 5rows

In [60]:
data = {
    'Oranges':[45,56,40,59,60,70,75,80,60,54],
    'Mangoes':[45,56,40,59,60,70,70,62,62,53]
}

In [ ]:
data = pd.DataFrame(data,index = ['Jan','Feb','Mar','April','May','June','Jul'])
'''
---------------------------------------------------------------------------
ValueError                                Traceback (most recent call last)
/usr/local/lib/python3.7/dist-packages/pandas/core/internals/managers.py in create_block_manager_from_arrays(arrays, names, axes)
   1692         blocks = form_blocks(arrays, names, axes)
-> 1693         mgr = BlockManager(blocks, axes)
   1694         mgr._consolidate_inplace()

6 frames
ValueError: Shape of passed values is (10, 2), indices imply (7, 2)

During handling of the above exception, another exception occurred:

ValueError                                Traceback (most recent call last)
/usr/local/lib/python3.7/dist-packages/pandas/core/internals/managers.py in create_block_manager_from_arrays(arrays, names, axes)
   1695         return mgr
   1696     except ValueError as e:
-> 1697         raise construction_error(len(arrays), arrays[0].shape, axes, e)
   1698 
   1699 

ValueError: Shape of passed values is (10, 2), indices imply (7, 2)
'''

In [61]:
data = pd.DataFrame(data,index = ['Jan','Feb','Mar','April','May','June','Jul','Aug','Sep','Oct'])

In [62]:
data

       Oranges  Mangoes
Jan         45       45
Feb         56       56
Mar         40       40
April       59       59
May         60       60
June        70       70
Jul         75       70
Aug         80       62
Sep         60       62
Oct         54       53

In [41]:
data.loc['Jan','Oranges']

45

In [30]:
#loc - Label or name based accessing of the elements from the dataframe

#data.loc['Jan','Oranges']

data.loc[:,['Oranges','Mangoes']] 

Dataframe_name.loc[row_criteria,column_criteria]

       Oranges  Mangoes
Jan         45       45
Feb         56       56
Mar         40       40
April       59       59
May         60       60
June        70       70
Jul         75       70
Aug         80       62
Sep         60       62
Oct         54       53

In [42]:
data[:]

       Oranges  Mangoes
Jan         45       45
Feb         56       56
Mar         40       40
April       59       59
May         60       60
June        70       70
Jul         75       70
Aug         80       62
Sep         60       62
Oct         54       53

In [33]:
#iloc - Index basd accessing
data.iloc[0,0:]

Oranges    45
Mangoes    45
Name: Jan, dtype: int64

In [46]:
data.head(10)

       Oranges  Mangoes
Jan         45       45
Feb         56       56
Mar         40       40
April       59       59
May         60       60
June        70       70
Jul         75       70
Aug         80       62
Sep         60       62
Oct         54       53

In [47]:
data.tail(2)

     Oranges  Mangoes
Sep       60       62
Oct       54       53

In [49]:
data.index.tolist()

['Jan', 'Feb', 'Mar', 'April', 'May', 'June', 'Jul', 'Aug', 'Sep', 'Oct']

In [50]:
data.values.tolist()

[[45, 45],
 [56, 56],
 [40, 40],
 [59, 59],
 [60, 60],
 [70, 70],
 [75, 70],
 [80, 62],
 [60, 62],
 [54, 53]]

In [51]:
data.shape

(10, 2)

In [55]:
data.loc[:,'New_col'] = None

In [63]:
#Changing the values of a particular row and col
data.loc['Mar','Mangoes'] = 70

In [64]:
data

       Oranges  Mangoes
Jan         45       45
Feb         56       56
Mar         40       70
April       59       59
May         60       60
June        70       70
Jul         75       70
Aug         80       62
Sep         60       62
Oct         54       53

In [66]:
!ls

sample_data

In [67]:
!dir

sample_data

In [68]:
#methods of reading data into Pandas dataframe! 
#CSV?
#Comma seperated values 
#reading a csv in colab
from google.colab import drive 
drive.mount('/drive')

import pandas as pd
df = pd.read_csv("/drive/My Drive/Colab Notebooks/data/purchases.csv")

Drive already mounted at /drive; to attempt to forcibly remount, call drive.mount("/drive", force_remount=True).

In [ ]:
#Jupyter Notebook 
import pandas as pd 
df = pd.read_csv("C:/Users/ln2/Downloads/purchases.csv")


UnicodeDecodeError: "utf-8" cannot decode byted

In [70]:
df = pd.read_csv("/drive/My Drive/Colab Notebooks/data/purchases.csv",index_col =0)
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [71]:
#import data from Json
#Json - Java Script Object Notation 
df = pd.read_json("/drive/My Drive/Colab Notebooks/data/purchases.json")

In [72]:
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [73]:
#How to open a database file
!pip install pysqlite3

Collecting pysqlite3
  Downloading https://files.pythonhosted.org/packages/76/36/c8c574a525868999f7f61bd74bb0065736804d341a913f8207880850e559/pysqlite3-0.4.6.tar.gz (40kB)
     |████████████████████████████████| 40kB 3.9MB/s
Building wheels for collected packages: pysqlite3
  Building wheel for pysqlite3 (setup.py) ... done
  Created wheel for pysqlite3: filename=pysqlite3-0.4.6-cp37-cp37m-linux_x86_64.whl size=132579 sha256=f4693f132af74a3b8e19fccea3e3ede93c075cb9cb9318e70f48787bbb021976
  Stored in directory: /root/.cache/pip/wheels/52/bd/85/9f859f07cb153f4d7e3ed094b821fb08b85935c2522c3bd9d4
Successfully built pysqlite3
Installing collected packages: pysqlite3
Successfully installed pysqlite3-0.4.6

In [74]:
import sqlite3
#SQL - Structured Query Language - In Databases to retrieve data from tables! Queries to access data from table
con = sqlite3.connect("database.db")

In [76]:
df = pd.read_sql_query("SELECT * FROM purchases",con)
df.set_index('index')

        apples  oranges
index
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [77]:
#CSV's from GITHUB 
movie_df = pd.read_csv("https://raw.githubusercontent.com/Laxminarayen/Inceptez_batch_16/main/IMDB-Movie-Data.csv")

In [78]:
movie_df.head()

   Rank                    Title  ... Revenue (Millions) Metascore
0     1  Guardians of the Galaxy  ...             333.13      76.0
1     2               Prometheus  ...             126.46      65.0
2     3                    Split  ...             138.12      62.0
3     4                     Sing  ...             270.32      59.0
4     5            Suicide Squad  ...             325.02      40.0

[5 rows x 12 columns]

In [ ]:
1. googleapiclient
2. Connection building

In [ ]:
SQL Alchemy - 
sqlite3 - 
JDBC/ODBC - Jayadebapi
psycopg2

In [ ]:
!pip install psycopg2
con = psycopg2.connect(dbname,username,pass,host,port)

In [81]:
#Open an Excel
df = pd.read_excel("/drive/My Drive/Colab Notebooks/data/Sample.xlsx")

In [8]:
import pandas as pd 
pd.read_excel("/drive/My Drive/Colab Notebooks/data/Sample.xlsx",engine = 'openpyxl')

In [ ]:
#CSV's from GITHUB 
movie_df = pd.read_csv("https://raw.githubusercontent.com/Laxminarayen/Inceptez_batch_16/main/IMDB-Movie-Data.csv")

In [84]:
movie_df.head(10)

   Rank                    Title  ... Revenue (Millions) Metascore
0     1  Guardians of the Galaxy  ...             333.13      76.0
1     2               Prometheus  ...             126.46      65.0
2     3                    Split  ...             138.12      62.0
3     4                     Sing  ...             270.32      59.0
4     5            Suicide Squad  ...             325.02      40.0
5     6           The Great Wall  ...              45.13      42.0
6     7               La La Land  ...             151.06      93.0
7     8                 Mindhorn  ...                NaN      71.0
8     9       The Lost City of Z  ...               8.01      78.0
9    10               Passengers  ...             100.01      41.0

[10 rows x 12 columns]

In [101]:
movie_df.loc[(movie_df['Rank'] == 4) & (movie_df['Title'] == 'Sing')]

   Rank Title                    Genre  ...  Votes Revenue (Millions) Metascore
3     4  Sing  Animation,Comedy,Family  ...  60545             270.32      59.0

[1 rows x 12 columns]

In [99]:
movie_df.loc[movie_df['Rank'].isin([2,3,4,5,6,7])]

   Rank           Title  ... Revenue (Millions) Metascore
1     2      Prometheus  ...             126.46      65.0
2     3           Split  ...             138.12      62.0
3     4            Sing  ...             270.32      59.0
4     5   Suicide Squad  ...             325.02      40.0
5     6  The Great Wall  ...              45.13      42.0
6     7      La La Land  ...             151.06      93.0

[6 rows x 12 columns]

In [102]:
movie_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

In [106]:
movie_df.shape[0]

1000

In [107]:
len(movie_df)

1000

In [112]:
movie_df.isna().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [ ]:
for i in movie_df:
  print(i)

In [ ]:
for i in movie_df:
  print(i)

In [ ]:
for i in movie_df['Abdul']:
  print(i)
'''
---------------------------------------------------------------------------
KeyError                                  Traceback (most recent call last)
/usr/local/lib/python3.7/dist-packages/pandas/core/indexes/base.py in get_loc(self, key, method, tolerance)
   2897             try:
-> 2898                 return self._engine.get_loc(casted_key)
   2899             except KeyError as err:

pandas/_libs/index.pyx in pandas._libs.index.IndexEngine.get_loc()

pandas/_libs/index.pyx in pandas._libs.index.IndexEngine.get_loc()

pandas/_libs/hashtable_class_helper.pxi in pandas._libs.hashtable.PyObjectHashTable.get_item()

pandas/_libs/hashtable_class_helper.pxi in pandas._libs.hashtable.PyObjectHashTable.get_item()

KeyError: 'Abdul'

The above exception was the direct cause of the following exception:

KeyError                                  Traceback (most recent call last)
2 frames
/usr/local/lib/python3.7/dist-packages/pandas/core/indexes/base.py in get_loc(self, key, method, tolerance)
   2898                 return self._engine.get_loc(casted_key)
   2899             except KeyError as err:
-> 2900                 raise KeyError(key) from err
   2901 
   2902         if tolerance is not None:

KeyError: 'Abdul'
'''

In [122]:
movie_df.columns.tolist()

['Rank',
 'Title',
 'Genre',
 'Description',
 'Director',
 'Actors',
 'Year',
 'Runtime (Minutes)',
 'Rating',
 'Votes',
 'Revenue (Millions)',
 'Metascore']

In [123]:
movie_df1.columns=movie_df.columns.str.lower()

In [124]:
movie_df1

Index(['rank', 'title', 'genre', 'description', 'director', 'actors', 'year',
       'runtime (minutes)', 'rating', 'votes', 'revenue (millions)',
       'metascore'],
      dtype='object')

In [125]:
movie_df.columns=movie_df.columns.str.lower()

In [126]:
movie_df

     rank                    title  ... revenue (millions) metascore
0       1  Guardians of the Galaxy  ...             333.13      76.0
1       2               Prometheus  ...             126.46      65.0
2       3                    Split  ...             138.12      62.0
3       4                     Sing  ...             270.32      59.0
4       5            Suicide Squad  ...             325.02      40.0
..    ...                      ...  ...                ...       ...
995   996     Secret in Their Eyes  ...                NaN      45.0
996   997          Hostel: Part II  ...              17.54      46.0
997   998   Step Up 2: The Streets  ...              58.01      50.0
998   999             Search Party  ...                NaN      22.0
999  1000               Nine Lives  ...              19.64      11.0

[1000 rows x 12 columns]

In [ ]:
sqlalchemy